# Ветвления / условный оператор

#num = int(input("Введи число"))

# if num < 0:
#     print("-")
# elif num > 0:
#     print('+')
# else:
#     print ('0')
#################################################

num = int(input())
if 0 <= num <= 100:
    if 80 <= num <= 100:
        print('Получил оценку 5')
    elif 60 <= num <= 79:
        print('Получил оценку 4')
    elif 40 <= num <= 59:
        print('Получил оценку 3')
    elif 0 <= num <= 39:
        print('Получил оценку 2')
else:
    print('Ошибка ввода числа')

#################################################

num_1 = int(input(' Введите первое число:'))
num_2 = int(input(' Введите второе число:'))

if num_1 % 10 == 5 and num_2 - 10 > 0:
    print ('Да')

